/* Напишите программу, которая будет выдавать название дня недели по заданному номеру.
3-> Среда 
5-> Пятница
*/

int userIntup = Convert.ToInt32(Console.ReadLine());
if(userIntup ==1)
Console.WriteLine("Понедельник");
if(userIntup ==2)
Console.WriteLine("Вторник");
if(userIntup ==3)
Console.WriteLine("Среда");
if(userIntup ==4)
Console.WriteLine("Четверг");
if(userIntup ==5)
Console.WriteLine("Пятница");
if(userIntup ==6)
Console.WriteLine("Суббота");
if(userIntup ==7)
Console.WriteLine("Воскресение");